books-api/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    books = Book.all

    render json: {
      count: books.length,
      books: books.sort_by {|book| [book.rating, book.publication_date]}

INSERT INTO "books" ("title", "author", "publication_date", "rating", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    book = Book.create!(valid_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "status" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "available"], ["updated_at", "2024-12-20 20:04:31.704570"], ["id", 3]]
---
  def update
    parameters = params.permit(:rating, :status)

    book = Book.find(params[:id])
    book.update!(status: params[:status]) if(params[:status].present?)